<?php
// създавам променлива /sum/, която ще ползвам за сумиране на числата
$sum=0;
// създавам "For" цикъл за да генерирам числата от 0 до 30 вкл.
for ($i=0; $i<31; $i++){
    // извеждам числата от 0-30, това по принцип е НЕнужно, 
    // но го оставям за прегледност
    echo $i.' ';
    // тук сумирам към променливата "sum", всяко получено число от "for"-a
    $sum=$i+$sum;
    }
   //Извеждам на екрана стойността, на променливата, съхранила сумата на числата
echo '<br/>'.'Сумата на числата от 0 до 30 е равна на:'. $sum;

