<?php
//Създавам променлива 'factorial5', която ще съдържа сбора на числата, 
//състоящи факториела на числото. Давам начална стойност '1', защото всяко число
// умножено по 0 е равно на 0.
$faktorial5=1;
//Създавам 'for' цикъл за да генерирам факториелите на всяко число
for ($i=5 ; $i>0 ; $i--){
    
    $faktorial5=$i*$faktorial5;
}
echo '5 факториел (5!) = '. $faktorial5. '<br/>';

//индентично ще е ис другите две числа, разликата ще е само във стойностите при
//написването на "for"-a.

$faktorial8=1;
for ($i=8 ; $i>0 ; $i--){
    $faktorial8=$i*$faktorial8;
}
echo '8 факториел (8!) = '. $faktorial8.'<br/>';

$faktorial10=1;
for ($i=10 ; $i>0 ; $i--){
    $faktorial10=$i*$faktorial10;
}
echo '10 факториел (10!) = '. $faktorial10;