<?php

//Създавам два вложени 'for' цикъла, за да си изградя 
//решетка от двете променливи
for ($i=1; $i<6; $i++){
   for($j=0;$j<=$i;$j++){       
       //тук проверявам дали първата променлива е по-голяма от втората и ако е
       //извеждам на екрана една звезда. Действието се повтаря докато
       // 'i' стане >= на 'j'
       if ($i>$j){
           echo '*';
     // когато първата променлива вече не е по-голяма от втората правя нов ред
    }else{
        echo '<br/>';
    }
}
}