<?php
//изграждам два 'for' цикъла, които изграждат решетка от двете променливи
for ($i=1 ; $i<6 ; $i++){
    for($j=0 ; $j<5 ; $j++){
// в случаите когато $i > $j извеждам звездичката
        if ($i>$j) {
            echo '* ';
        }  
      }
//след като свърши действието във втория цикъл извеждам нов ред, след което
// се връща в първия цикъл до изпълване на условието в него
    echo '<br/>';
}
// за втората част от решетката изграждам същото нещо, като за първата част,
//  но с обратно изградена решетка 

// Много време отделих за да направя с една по-голяма решетка цялостното условие
// с два вложени IF-a с обратни условия, но не успях... пробвах, но не се получи
//  заради двата реда с по 5 звездички...
  
//   Ще ми е интересно да видя готово решение с една двойка вложени "for"-a
for ($i=6; $i>0; $i--){
    for($j=5;$j>0;$j--){         
        if ($i>$j){
           echo '* ';
        }   
    }
    echo '<br/>';
}
