<?php

//инициализирам променлива = 1 , която ще се увеличава с всяка проверка на If-a 
//по-долу и ще образува числата за "триъгълника"
$result_number5=1;
//създавам два вложени "for" цикъла, които да образуват решетка от двете променливи
for ($i=1; $i<6; $i++){
   for($j=0;$j<=$i;$j++){       
       //с този "if" изграждам структурата на триъгълника, избирам кодът в 
       //следващия абзац? да се извърши само при $i>$j за да се образува триъгълник
       
       //  тук трябва да си призная че се наложи да поналучкам леко стойностите
       //  в двата for цикъла за да се получи както трябва... 
       if ($i>$j){
           //извеждам началната стойност на променливата (($result_number5) = 1)
           //и с всеки цикъл увеличавам нейната стойност с 1
           echo $result_number5.' ';
           $result_number5++;
           }else{
           // когато изразът /$i>$j/ не е верен извеждам нов ред
        echo '<br/>';
    }
}
}

echo '<br/>';
// тук и на следващият триъгълник, всичко е като на горния, но решетката
//  от вложените цикли е по- голяма
$result_number10=1;
for ($i=1; $i<11; $i++){
   for($j=0;$j<=$i;$j++){       
       if ($i>$j){
           echo $result_number10.' ';
           $result_number10++;
           }else{
        echo '<br/>';
    }
}
}

echo '<br/>';

$result_number21=1;
for ($i=1; $i<22; $i++){
   for($j=0;$j<=$i;$j++){       
       if ($i>$j){
           /* тук опитах да направя разстояние между числата, така че
              едноцифрените, двуцифрените и трицифрените да станат еднакво
              големи и триъгълника да бъде идеално прав, но не се получи,
              затова го закоментирах...
              
               //влизам първо в едно- и дву-цифровите (от 1 до 99)
                // и им добавям един интервал
               if($result_number21<100){
               echo " ";
               // след това избирам едночислените (от 1 до 9)
               // и им добавям още един интервал
               if ($result_number21<10)
               echo "  ";
               }
               */
           echo $result_number21.' ';
           $result_number21++;
           }else{
        echo '<br/>';
    }
}
}